dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm33_ns/usb_camera_host.c
#include "usb_camera_host.h"

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "USBH.h"
#include "USBH_Util.h"
#include "USBH_VIDEO.h"
#include "cyabs_rtos.h"
#include "cyabs_rtos_impl.h"
#include "cy_utils.h"
#include "FreeRTOS.h"
#include "task.h"

#define USB_CAMERA_NUM_FRAME_BUFFERS       (2U)
#define USB_CAMERA_MAX_VIDEO_INTERFACES    (4U)
#define USB_CAMERA_TASK_STACK_SIZE_BYTES   (8192U)
#define USB_CAMERA_TASK_PRIORITY           (configMAX_PRIORITIES - 2)
#define USB_CAMERA_USBH_ISR_PRIORITY       (configMAX_PRIORITIES - 1)
#define USB_CAMERA_FRAME_INTERVAL_0P3MP    (333332UL)
#define USB_CAMERA_FRAME_INTERVAL_LOGI     (1000000UL)
#define USB_CAMERA_FORMAT                  USBH_VIDEO_VS_FORMAT_UNCOMPRESSED
#define USB_CAMERA_REOPEN_RETRIES          (10U)
#define USB_CAMERA_REOPEN_DELAY_MS         (300U)
#define USB_CAMERA_MAX_STREAM_ERRORS       (10U)
#define USB_CAMERA_STREAM_KEEPALIVE_MS     (45000U)
#define USB_CAMERA_FRAME_TRACE_LOGS        (1U)
#define USB_CAMERA_FRAME_TRACE_LIMIT       (12U)
#define USB_CAMERA_ROW_BYTES               (USB_CAMERA_FRAME_WIDTH * 2U)
#define USB_CAMERA_CAPTURE_FRAME_BYTES     (USB_CAMERA_FRAME_BYTES)

#define USB_CAMERA_LOGITECH_VID            (0x046DU)
#define USB_CAMERA_LOGITECH_C920_PID       (0x08E5U)
#define USB_CAMERA_LOGITECH_C920E_PID      (0x08B6U)
#define USB_CAMERA_HBVCAM_0P3_VID          (0x058FU)
#define USB_CAMERA_HBVCAM_0P3_PID          (0x5608U)

static cy_thread_t usbh_main_task_handle;
static cy_thread_t usbh_isr_task_handle;
static cy_thread_t usb_camera_task_handle;
static cy_queue_t video_mail_box;
static cy_queue_t device_state_mail_box;
static cy_mutex_t latest_frame_mutex;
static cy_mutex_t snapshot_request_mutex;
static cy_semaphore_t snapshot_ready_semaphore;
static USBH_NOTIFICATION_HOOK camera_notification_hook;

CY_SECTION(".cy_gpu_buf")
static uint8_t frame_buffers[USB_CAMERA_NUM_FRAME_BUFFERS][USB_CAMERA_CAPTURE_FRAME_BYTES];
static size_t frame_lengths[USB_CAMERA_NUM_FRAME_BUFFERS];
static uint16_t frame_source_strides[USB_CAMERA_NUM_FRAME_BUFFERS];
static uint8_t latest_frame_index = 0U;
static uint8_t capture_frame_index = 0U;
static bool latest_frame_ready = false;
static volatile uint8_t device_connected = 0U;
static bool usb_camera_host_initialized = false;
static bool usb_camera_connected = false;
static bool usb_camera_supported = false;
static volatile bool usb_camera_stream_active = false;
static uint32_t usb_camera_stream_error_count = 0U;
static uint32_t usb_camera_complete_frame_count = 0U;
static uint32_t usb_camera_short_frame_count = 0U;
static uint32_t usb_camera_overflow_frame_count = 0U;
static size_t usb_camera_capture_bytes = 0U;
static size_t usb_camera_capture_raw_bytes = 0U;
static bool usb_camera_drop_frame = false;
static volatile bool snapshot_request_pending = false;
static volatile bool snapshot_capture_success = false;
static volatile uint8_t usb_camera_device_index = 0xFFU;
static USBH_VIDEO_DEVICE_HANDLE usb_camera_device_handle;
static USBH_VIDEO_INTERFACE_INFO usb_camera_interface_info;
static bool usb_camera_device_opened = false;
static volatile TickType_t usb_camera_stream_keepalive_deadline = 0U;

#define USB_CAMERA_SIGNAL_DEVICE_REMOVED      (0xFFU)
#define USB_CAMERA_SIGNAL_TRANSFER_ERROR      (0xFEU)
#define USB_CAMERA_SIGNAL_SNAPSHOT_READY      (0xA5U)
#define USB_CAMERA_SIGNAL_SNAPSHOT_ABORT      (0xA4U)

static void usb_camera_task(void *arg);
static void usb_camera_add_remove_device_cb(void *context, U8 dev_index, USBH_DEVICE_EVENT event);
static void usb_camera_on_data_cb(USBH_VIDEO_DEVICE_HANDLE h_device,
                                  USBH_VIDEO_STREAM_HANDLE h_stream,
                                  USBH_STATUS status,
                                  const U8 *p_data,
                                  unsigned num_bytes,
                                  U32 flags,
                                  void *p_user_data_context);
static void usb_camera_handle_device(U8 dev_index);
static void usb_camera_clear_latest_frame(void);
static bool usb_camera_select_stream(USBH_VIDEO_DEVICE_HANDLE h_device,
                                     uint32_t frame_interval,
                                     USBH_VIDEO_STREAM_CONFIG *stream_info,
                                     uint32_t *selected_interval);
static unsigned usb_camera_get_frame_descriptor_count(const USBH_VIDEO_FORMAT_INFO *format_info);
static uint32_t usb_camera_frame_interval_for_device(uint16_t vendor_id, uint16_t product_id);
static bool usb_camera_open_device(U8 dev_index);
static void usb_camera_close_device(void);
static void usb_camera_reset_capture_state(void);
static void usb_camera_signal_snapshot_ready(void);
static void usb_camera_append_eof_frame_data(const U8 *p_data, size_t num_bytes, U32 flags);
static void usb_camera_finish_eof_frame(U32 flags);
static void usb_camera_build_bmp_from_latest(uint8_t *out_bmp,
                                             size_t out_bmp_size,
                                             size_t *out_bmp_len,
                                             uint16_t *out_width,
                                             uint16_t *out_height);
static bool usb_camera_publish_capture_frame(size_t frame_len);
static size_t usb_camera_get_expected_frame_bytes(void);
static void yuyv_to_rgb_pixel(const uint8_t *frame,
                              uint32_t source_row_bytes,
                              uint16_t x,
                              uint16_t y,
                              uint8_t *r, uint8_t *g, uint8_t *b);
static uint8_t clamp_u8(int32_t value);

cy_rslt_t usb_camera_host_init(void)
{
    cy_rslt_t result;

    if (usb_camera_host_initialized)
    {
        return CY_RSLT_SUCCESS;
    }

    memset(frame_buffers, 0, sizeof(frame_buffers));
    memset(frame_lengths, 0, sizeof(frame_lengths));
    memset(frame_source_strides, 0, sizeof(frame_source_strides));
    latest_frame_ready = false;
    usb_camera_connected = false;
    usb_camera_supported = false;
    latest_frame_index = 0U;
    capture_frame_index = 0U;
    memset(&usb_camera_device_handle, 0, sizeof(usb_camera_device_handle));
    memset(&usb_camera_interface_info, 0, sizeof(usb_camera_interface_info));
    usb_camera_device_opened = false;
    usb_camera_complete_frame_count = 0U;
    usb_camera_short_frame_count = 0U;
    usb_camera_overflow_frame_count = 0U;
    usb_camera_reset_capture_state();
    printf("[CAMERA] Target stream %ux%u YUYV (%lu bytes/frame, %lu bytes buffers)\n",
           (unsigned)USB_CAMERA_FRAME_WIDTH,
           (unsigned)USB_CAMERA_FRAME_HEIGHT,
           (unsigned long)USB_CAMERA_FRAME_BYTES,
           (unsigned long)sizeof(frame_buffers));

    result = cy_rtos_mutex_init(&latest_frame_mutex, false);
    if (result != CY_RSLT_SUCCESS)
    {
        printf("[CAMERA] Failed to init latest frame mutex\n");
        return result;
    }

    result = cy_rtos_queue_init(&video_mail_box, sizeof(U8), USB_CAMERA_MAX_VIDEO_INTERFACES);
    if (result != CY_RSLT_SUCCESS)
    {
        printf("[CAMERA] Failed to init video mailbox\n");
        return result;
    }

    result = cy_rtos_queue_init(&device_state_mail_box, sizeof(U8), 1U);
    if (result != CY_RSLT_SUCCESS)
    {
        printf("[CAMERA] Failed to init camera device state mailbox\n");
        return result;
    }

    result = cy_rtos_mutex_init(&snapshot_request_mutex, false);
    if (result != CY_RSLT_SUCCESS)
    {
        printf("[CAMERA] Failed to init snapshot request mutex\n");
        return result;
    }

    result = cy_rtos_semaphore_init(&snapshot_ready_semaphore, 1U, 0U);
    if (result != CY_RSLT_SUCCESS)
    {
        printf("[CAMERA] Failed to init snapshot ready semaphore\n");
        return result;
    }

    result = cy_rtos_thread_create(&usb_camera_task_handle,
                                   usb_camera_task,
                                   "CM33 USB Camera",
                                   NULL,
                                   USB_CAMERA_TASK_STACK_SIZE_BYTES,
                                   USB_CAMERA_TASK_PRIORITY,
                                   NULL);
    if (result == CY_RSLT_SUCCESS)
    {
        usb_camera_host_initialized = true;
        printf("[CAMERA] USB host camera task started\n");
    }
    else
    {
        printf("[CAMERA] Failed to start USB camera task\n");
    }

    return result;
}

bool usb_camera_host_request_snapshot(uint32_t timeout_ms)
{
    cy_rslt_t result;
    U8 dev_index;

    if ((!usb_camera_host_initialized) || (device_connected == 0U) || (usb_camera_device_index == 0xFFU))
    {
        return false;
    }

