dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm33_ns/usb_camera_host.c
    if (cy_rtos_mutex_get(&snapshot_request_mutex, CY_RTOS_NEVER_TIMEOUT) != CY_RSLT_SUCCESS)
    {
        return false;
    }

    while (cy_rtos_semaphore_get(&snapshot_ready_semaphore, 0U) == CY_RSLT_SUCCESS)
    {
    }

    if (usb_camera_stream_active)
    {
        usb_camera_stream_keepalive_deadline =
            xTaskGetTickCount() + pdMS_TO_TICKS(USB_CAMERA_STREAM_KEEPALIVE_MS);

        snapshot_capture_success = false;
        snapshot_request_pending = true;
        result = cy_rtos_semaphore_get(&snapshot_ready_semaphore, timeout_ms);
        snapshot_request_pending = false;
        cy_rtos_mutex_set(&snapshot_request_mutex);
        return ((result == CY_RSLT_SUCCESS) && snapshot_capture_success);
    }

    cy_rtos_queue_reset(&device_state_mail_box);
    snapshot_capture_success = false;
    snapshot_request_pending = true;
    dev_index = usb_camera_device_index;

    result = cy_rtos_queue_put(&video_mail_box, &dev_index, 0U);
    if (result != CY_RSLT_SUCCESS)
    {
        snapshot_request_pending = false;
        cy_rtos_mutex_set(&snapshot_request_mutex);
        return false;
    }

    result = cy_rtos_semaphore_get(&snapshot_ready_semaphore, timeout_ms);
    if (result != CY_RSLT_SUCCESS)
    {
        snapshot_request_pending = false;
        snapshot_capture_success = false;
    }
    snapshot_request_pending = false;
    cy_rtos_mutex_set(&snapshot_request_mutex);

    return ((result == CY_RSLT_SUCCESS) && snapshot_capture_success);
}

bool usb_camera_host_get_snapshot_bmp(uint8_t *out_bmp,
                                      size_t out_bmp_size,
                                      size_t *out_bmp_len,
                                      uint16_t *out_width,
                                      uint16_t *out_height)
{
    if ((!usb_camera_host_initialized) || (!latest_frame_ready) || (out_bmp == NULL))
    {
        return false;
    }

    if (cy_rtos_mutex_get(&latest_frame_mutex, 1000U) != CY_RSLT_SUCCESS)
    {
        return false;
    }

    usb_camera_build_bmp_from_latest(out_bmp, out_bmp_size, out_bmp_len, out_width, out_height);

    cy_rtos_mutex_set(&latest_frame_mutex);
    return true;
}

bool usb_camera_host_get_latest_yuyv(uint8_t *out_frame,
                                     size_t out_frame_size,
                                     size_t *out_frame_len,
                                     uint16_t *out_width,
                                     uint16_t *out_height,
                                     uint16_t *out_source_stride)
{
    size_t latest_frame_len;
    uint16_t latest_source_stride;

    if ((!usb_camera_host_initialized) ||
        (!latest_frame_ready) ||
        (out_frame == NULL))
    {
        if (out_frame_len != NULL)
        {
            *out_frame_len = 0U;
        }
        return false;
    }

    if (cy_rtos_mutex_get(&latest_frame_mutex, 1000U) != CY_RSLT_SUCCESS)
    {
        if (out_frame_len != NULL)
        {
            *out_frame_len = 0U;
        }
        return false;
    }

    latest_frame_len = frame_lengths[latest_frame_index];
    latest_source_stride = frame_source_strides[latest_frame_index];
    if ((latest_frame_len == 0U) || (out_frame_size < latest_frame_len))
    {
        cy_rtos_mutex_set(&latest_frame_mutex);
        if (out_frame_len != NULL)
        {
            *out_frame_len = 0U;
        }
        return false;
    }

    memcpy(out_frame, frame_buffers[latest_frame_index], latest_frame_len);
    cy_rtos_mutex_set(&latest_frame_mutex);

    if (out_frame_len != NULL)
    {
        *out_frame_len = latest_frame_len;
    }
    if (out_width != NULL)
    {
        *out_width = USB_CAMERA_FRAME_WIDTH;
    }
    if (out_height != NULL)
    {
        *out_height = USB_CAMERA_FRAME_HEIGHT;
    }
    if (out_source_stride != NULL)
    {
        *out_source_stride = latest_source_stride;
    }

    return true;
}

bool usb_camera_host_borrow_latest_yuyv(const uint8_t **out_frame,
                                        size_t *out_frame_len,
                                        uint16_t *out_width,
                                        uint16_t *out_height,
                                        uint16_t *out_source_stride)
{
    if (out_frame != NULL)
    {
        *out_frame = NULL;
    }
    if (out_frame_len != NULL)
    {
        *out_frame_len = 0U;
    }

    if ((!usb_camera_host_initialized) ||
        (!latest_frame_ready) ||
        (out_frame == NULL) ||
        (out_frame_len == NULL))
    {
        return false;
    }

    if (cy_rtos_mutex_get(&latest_frame_mutex, 1000U) != CY_RSLT_SUCCESS)
    {
        return false;
    }

    if (frame_lengths[latest_frame_index] == 0U)
    {
        cy_rtos_mutex_set(&latest_frame_mutex);
        return false;
    }

    *out_frame = frame_buffers[latest_frame_index];
    *out_frame_len = frame_lengths[latest_frame_index];
    if (out_width != NULL)
    {
        *out_width = USB_CAMERA_FRAME_WIDTH;
    }
    if (out_height != NULL)
    {
        *out_height = USB_CAMERA_FRAME_HEIGHT;
    }
    if (out_source_stride != NULL)
    {
        *out_source_stride = frame_source_strides[latest_frame_index];
    }

    return true;
}

void usb_camera_host_release_latest_yuyv(void)
{
    (void)cy_rtos_mutex_set(&latest_frame_mutex);
}

bool usb_camera_host_is_stream_active(void)
{
    return (usb_camera_stream_active && usb_camera_supported);
}

static void usb_camera_clear_latest_frame(void)
{
    if (cy_rtos_mutex_get(&latest_frame_mutex, 1000U) == CY_RSLT_SUCCESS)
    {
        latest_frame_ready = false;
        frame_lengths[latest_frame_index] = 0U;
        cy_rtos_mutex_set(&latest_frame_mutex);
    }
    else
    {
        latest_frame_ready = false;
    }
}

static bool usb_camera_open_device(U8 dev_index)
{
    USBH_STATUS status = USBH_STATUS_ERROR;
    uint32_t open_attempt;

    if (usb_camera_device_opened)
    {
        return true;
    }

    memset(&usb_camera_device_handle, 0, sizeof(usb_camera_device_handle));
    memset(&usb_camera_interface_info, 0, sizeof(usb_camera_interface_info));

    for (open_attempt = 0U; open_attempt < USB_CAMERA_REOPEN_RETRIES; ++open_attempt)
    {
        status = USBH_VIDEO_Open(dev_index, &usb_camera_device_handle);
        if (status == USBH_STATUS_SUCCESS)
        {
            status = USBH_VIDEO_GetInterfaceInfo(usb_camera_device_handle, &usb_camera_interface_info);
            if (status == USBH_STATUS_SUCCESS)
            {
                usb_camera_device_opened = true;
                printf("[CAMERA] VID=0x%04X PID=0x%04X\n",
                       usb_camera_interface_info.VendorId,
                       usb_camera_interface_info.ProductId);

