dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm33_ns/usb_camera_host.c
                return true;
            }

            printf("[CAMERA] USBH_VIDEO_GetInterfaceInfo retry %lu/%lu failed: %s\n",
                   (unsigned long)(open_attempt + 1U),
                   (unsigned long)USB_CAMERA_REOPEN_RETRIES,
                   USBH_GetStatusStr(status));
            USBH_VIDEO_Close(usb_camera_device_handle);
            memset(&usb_camera_device_handle, 0, sizeof(usb_camera_device_handle));
        }
        else
        {
            printf("[CAMERA] USBH_VIDEO_Open retry %lu/%lu failed: %s\n",
                   (unsigned long)(open_attempt + 1U),
                   (unsigned long)USB_CAMERA_REOPEN_RETRIES,
                   USBH_GetStatusStr(status));
        }

        if (device_connected == 0U)
        {
            break;
        }

        cy_rtos_delay_milliseconds(USB_CAMERA_REOPEN_DELAY_MS);
    }

    return false;
}

static void usb_camera_close_device(void)
{
    if (usb_camera_device_opened)
    {
        USBH_VIDEO_Close(usb_camera_device_handle);
    }

    memset(&usb_camera_device_handle, 0, sizeof(usb_camera_device_handle));
    memset(&usb_camera_interface_info, 0, sizeof(usb_camera_interface_info));
    usb_camera_device_opened = false;
}

static void usb_camera_reset_capture_state(void)
{
    usb_camera_capture_bytes = 0U;
    usb_camera_capture_raw_bytes = 0U;
    usb_camera_drop_frame = false;
}

static void usb_camera_signal_snapshot_ready(void)
{
    U8 signal = USB_CAMERA_SIGNAL_SNAPSHOT_READY;

    snapshot_capture_success = true;
    snapshot_request_pending = false;
    (void)cy_rtos_queue_put(&device_state_mail_box, &signal, 0U);
}

static void usb_camera_append_eof_frame_data(const U8 *p_data, size_t num_bytes, U32 flags)
{
    const size_t expected_frame_bytes = usb_camera_get_expected_frame_bytes();

    (void)flags;

    if ((p_data == NULL) || (num_bytes == 0U))
    {
        return;
    }

    usb_camera_capture_raw_bytes += num_bytes;

    if (usb_camera_drop_frame)
    {
        return;
    }

    if ((usb_camera_capture_bytes + num_bytes) > expected_frame_bytes)
    {
        usb_camera_drop_frame = true;
        usb_camera_overflow_frame_count++;
        usb_camera_capture_bytes = 0U;
        return;
    }

    memcpy(&frame_buffers[capture_frame_index][usb_camera_capture_bytes],
           p_data,
           num_bytes);
    usb_camera_capture_bytes += num_bytes;
}

static void usb_camera_finish_eof_frame(U32 flags)
{
    const size_t expected_frame_bytes = usb_camera_get_expected_frame_bytes();

    if (usb_camera_drop_frame)
    {
        usb_camera_short_frame_count++;
#if USB_CAMERA_FRAME_TRACE_LOGS
        if ((usb_camera_complete_frame_count + usb_camera_short_frame_count) <=
            USB_CAMERA_FRAME_TRACE_LIMIT)
        {
            printf("[CAMERA] Dropping overflow frame raw=%lu expected=%lu short=%lu overflow=%lu flags=0x%lx\n",
                   (unsigned long)usb_camera_capture_raw_bytes,
                   (unsigned long)expected_frame_bytes,
                   (unsigned long)usb_camera_short_frame_count,
                   (unsigned long)usb_camera_overflow_frame_count,
                   (unsigned long)flags);
        }
#endif
    }
    else if ((usb_camera_capture_bytes == expected_frame_bytes) &&
             usb_camera_publish_capture_frame(usb_camera_capture_bytes))
    {
        usb_camera_complete_frame_count++;
#if USB_CAMERA_FRAME_TRACE_LOGS
        if ((usb_camera_complete_frame_count + usb_camera_short_frame_count) <=
            USB_CAMERA_FRAME_TRACE_LIMIT)
        {
            printf("[CAMERA] Frame complete captured=%lu raw=%lu complete=%lu short=%lu overflow=%lu flags=0x%lx\n",
                   (unsigned long)usb_camera_capture_bytes,
                   (unsigned long)usb_camera_capture_raw_bytes,
                   (unsigned long)usb_camera_complete_frame_count,
                   (unsigned long)usb_camera_short_frame_count,
                   (unsigned long)usb_camera_overflow_frame_count,
                   (unsigned long)flags);
        }
#endif
        if (snapshot_request_pending)
        {
            usb_camera_signal_snapshot_ready();
        }
    }
    else
    {
        usb_camera_short_frame_count++;
#if USB_CAMERA_FRAME_TRACE_LOGS
        if ((usb_camera_complete_frame_count + usb_camera_short_frame_count) <=
            USB_CAMERA_FRAME_TRACE_LIMIT)
        {
            printf("[CAMERA] Dropping short frame captured=%lu expected=%lu raw=%lu short=%lu overflow=%lu flags=0x%lx\n",
                   (unsigned long)usb_camera_capture_bytes,
                   (unsigned long)expected_frame_bytes,
                   (unsigned long)usb_camera_capture_raw_bytes,
                   (unsigned long)usb_camera_short_frame_count,
                   (unsigned long)usb_camera_overflow_frame_count,
                   (unsigned long)flags);
        }
#endif
    }

    usb_camera_capture_bytes = 0U;
    usb_camera_capture_raw_bytes = 0U;
    usb_camera_drop_frame = false;
}

static void usb_camera_task(void *arg)
{
    U8 dev_index;
    cy_rslt_t result;

    (void)arg;

    USBH_Init();

    result = cy_rtos_create_thread(&usbh_main_task_handle,
                                   (void *)USBH_Task,
                                   "USBH_Task",
                                   NULL,
                                   USB_CAMERA_TASK_STACK_SIZE_BYTES,
                                   USB_CAMERA_TASK_PRIORITY,
                                   NULL);
    if (result != CY_RSLT_SUCCESS)
    {
        printf("[CAMERA] Failed to start USBH main task\n");
        return;
    }

    result = cy_rtos_create_thread(&usbh_isr_task_handle,
                                   (void *)USBH_ISRTask,
                                   "USBH_ISR",
                                   NULL,
                                   USB_CAMERA_TASK_STACK_SIZE_BYTES,
                                   USB_CAMERA_USBH_ISR_PRIORITY,
                                   NULL);
    if (result != CY_RSLT_SUCCESS)
    {
        printf("[CAMERA] Failed to start USBH ISR task\n");
        return;
    }

    if (USBH_VIDEO_Init() != USBH_STATUS_SUCCESS)
    {
        printf("[CAMERA] USBH_VIDEO_Init failed\n");
        return;
    }

    if (USBH_VIDEO_AddNotification(&camera_notification_hook,
                                   usb_camera_add_remove_device_cb,
                                   NULL) != USBH_STATUS_SUCCESS)
    {
        printf("[CAMERA] Failed to add USB camera notification hook\n");
        return;
    }

    for (;;)
    {
        if (cy_rtos_queue_get(&video_mail_box, &dev_index, CY_RTOS_NEVER_TIMEOUT) == CY_RSLT_SUCCESS)
        {
            usb_camera_handle_device(dev_index);
        }
    }
}

