dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm33_ns/usb_camera_host.c
static void usb_camera_add_remove_device_cb(void *context, U8 dev_index, USBH_DEVICE_EVENT event)
{
    U8 signal = USB_CAMERA_SIGNAL_DEVICE_REMOVED;

    (void)context;

    if (event == USBH_DEVICE_EVENT_ADD)
    {
        device_connected = 1U;
        usb_camera_connected = true;
        usb_camera_stream_error_count = 0U;
        usb_camera_device_index = dev_index;
        usb_camera_close_device();
        snapshot_request_pending = false;
        snapshot_capture_success = false;
        usb_camera_clear_latest_frame();
        printf("[CAMERA] USB camera device added index=%u\n", (unsigned)dev_index);
    }
    else if (event == USBH_DEVICE_EVENT_REMOVE)
    {
        device_connected = 0U;
        usb_camera_connected = false;
        usb_camera_supported = false;
        usb_camera_device_index = 0xFFU;
        usb_camera_close_device();
        snapshot_request_pending = false;
        snapshot_capture_success = false;
        (void)cy_rtos_queue_put(&device_state_mail_box, &signal, 0U);
        (void)cy_rtos_semaphore_set(&snapshot_ready_semaphore);
        printf("[CAMERA] USB camera device removed index=%u\n", (unsigned)dev_index);
    }
}

static void usb_camera_on_data_cb(USBH_VIDEO_DEVICE_HANDLE h_device,
                                  USBH_VIDEO_STREAM_HANDLE h_stream,
                                  USBH_STATUS status,
                                  const U8 *p_data,
                                  unsigned num_bytes,
                                  U32 flags,
                                  void *p_user_data_context)
{
    USBH_STATUS restart_status = USBH_STATUS_SUCCESS;
    I8 is_stream_stopped = 0;

    (void)h_device;
    (void)p_user_data_context;

    if (status != USBH_STATUS_SUCCESS)
    {
        U8 signal = USB_CAMERA_SIGNAL_TRANSFER_ERROR;
        usb_camera_reset_capture_state();

        if (snapshot_capture_success)
        {
            return;
        }

        if (snapshot_request_pending)
        {
            usb_camera_stream_error_count++;

            if ((status != USBH_STATUS_DEVICE_REMOVED) &&
                (usb_camera_stream_error_count < 3U))
            {
                restart_status = USBH_VIDEO_GetStreamState(h_stream, &is_stream_stopped);
                if ((restart_status == USBH_STATUS_SUCCESS) && (is_stream_stopped == 1))
                {
                    restart_status = USBH_VIDEO_RestartStream(h_stream);
                    if (restart_status == USBH_STATUS_SUCCESS)
                    {
                        printf("[CAMERA] Restarted USB stream while waiting for snapshot frame\n");
                        return;
                    }
                }
            }

            snapshot_request_pending = false;
            snapshot_capture_success = false;
            (void)cy_rtos_queue_put(&device_state_mail_box, &signal, 0U);
            return;
        }

        usb_camera_stream_error_count++;

        if ((status != USBH_STATUS_DEVICE_REMOVED) &&
            (usb_camera_stream_error_count < USB_CAMERA_MAX_STREAM_ERRORS))
        {
            restart_status = USBH_VIDEO_GetStreamState(h_stream, &is_stream_stopped);
            if (restart_status == USBH_STATUS_SUCCESS)
            {
                if (is_stream_stopped == 1)
                {
                    restart_status = USBH_VIDEO_RestartStream(h_stream);
                    if (restart_status == USBH_STATUS_SUCCESS)
                    {
                        printf("[CAMERA] Restarted USB stream after transfer error\n");
                        usb_camera_stream_error_count = 0U;
                    }
                    else
                    {
                        printf("[CAMERA] USBH_VIDEO_RestartStream failed: %s\n",
                               USBH_GetStatusStr(restart_status));
                    }
                }
                else
                {
                    printf("[CAMERA] USB stream reported transfer error while still running\n");
                    restart_status = USBH_STATUS_SUCCESS;
                }
            }
            else
            {
                printf("[CAMERA] USBH_VIDEO_GetStreamState failed: %s\n",
                       USBH_GetStatusStr(restart_status));
            }
        }

        if ((status == USBH_STATUS_DEVICE_REMOVED) ||
            (usb_camera_stream_error_count >= USB_CAMERA_MAX_STREAM_ERRORS) ||
            (restart_status != USBH_STATUS_SUCCESS))
        {
            (void)cy_rtos_queue_put(&device_state_mail_box, &signal, 0U);
        }
        return;
    }

    usb_camera_stream_error_count = 0U;

    usb_camera_append_eof_frame_data(p_data, (size_t)num_bytes, flags);
    if ((flags & USBH_UVC_END_OF_FRAME) != 0U)
    {
        usb_camera_finish_eof_frame(flags);
    }

    (void)USBH_VIDEO_Ack(h_stream);
}

static void usb_camera_handle_device(U8 dev_index)
{
    USBH_VIDEO_STREAM_CONFIG stream_info;
    USBH_VIDEO_STREAM_HANDLE stream;
    USBH_STATUS status;
    uint32_t frame_interval;
    uint32_t selected_interval = 0U;
    U8 signal = 0U;

    memset(&stream, 0, sizeof(stream));
    memset(&stream_info, 0, sizeof(stream_info));

    if (!usb_camera_open_device(dev_index))
    {
        return;
    }

    usb_camera_complete_frame_count = 0U;
    usb_camera_short_frame_count = 0U;
    usb_camera_overflow_frame_count = 0U;
    usb_camera_reset_capture_state();

    frame_interval = usb_camera_frame_interval_for_device(usb_camera_interface_info.VendorId,
                                                          usb_camera_interface_info.ProductId);
    if (frame_interval == 0U)
    {
        printf("[CAMERA] Unsupported USB camera VID=0x%04X PID=0x%04X\n",
               usb_camera_interface_info.VendorId,
               usb_camera_interface_info.ProductId);
        usb_camera_close_device();
        return;
    }

    if (!usb_camera_select_stream(usb_camera_device_handle,
                                  frame_interval,
                                  &stream_info,
                                  &selected_interval))
    {
        printf("[CAMERA] Unable to find supported %ux%u YUYV stream\n",
               (unsigned)USB_CAMERA_FRAME_WIDTH,
               (unsigned)USB_CAMERA_FRAME_HEIGHT);
        usb_camera_close_device();
        return;
    }

    status = USBH_VIDEO_OpenStream(usb_camera_device_handle, &stream_info, &stream);
    if (status != USBH_STATUS_SUCCESS)
    {
        printf("[CAMERA] USBH_VIDEO_OpenStream failed: %s\n", USBH_GetStatusStr(status));
        usb_camera_close_device();
        return;
    }

