dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm33_ns/usb_camera_host.c
    usb_camera_supported = true;
    usb_camera_stream_active = true;
    usb_camera_stream_error_count = 0U;
    usb_camera_stream_keepalive_deadline =
        xTaskGetTickCount() + pdMS_TO_TICKS(USB_CAMERA_STREAM_KEEPALIVE_MS);
    printf("[CAMERA] USB stream started %ux%u @ %.2f fps\n",
           (unsigned)USB_CAMERA_FRAME_WIDTH,
           (unsigned)USB_CAMERA_FRAME_HEIGHT,
           (selected_interval != 0U) ? (10000000.0f / (float)selected_interval) : 0.0f);
    printf("[CAMERA] Using Infineon-style emUSB frame assembly, sourceStride=%lu frameBytes=%lu\n",
           (unsigned long)USB_CAMERA_ROW_BYTES,
           (unsigned long)USB_CAMERA_FRAME_BYTES);

    cy_rtos_queue_reset(&device_state_mail_box);
    while (device_connected != 0U)
    {
        if (cy_rtos_queue_get(&device_state_mail_box, &signal, 10U) == CY_RSLT_SUCCESS)
        {
            if (signal == USB_CAMERA_SIGNAL_SNAPSHOT_READY)
            {
                usb_camera_stream_keepalive_deadline =
                    xTaskGetTickCount() + pdMS_TO_TICKS(USB_CAMERA_STREAM_KEEPALIVE_MS);
                (void)cy_rtos_semaphore_set(&snapshot_ready_semaphore);
                signal = 0U;
                continue;
            }
            break;
        }

        if ((!snapshot_request_pending) &&
            ((int32_t)(xTaskGetTickCount() - usb_camera_stream_keepalive_deadline) >= 0))
        {
            break;
        }
    }

    (void)USBH_VIDEO_CloseStream(stream);
    usb_camera_supported = false;
    usb_camera_stream_active = false;
    printf("[CAMERA] USB stream stopped\n");

    if ((signal == USB_CAMERA_SIGNAL_TRANSFER_ERROR) ||
        (signal == USB_CAMERA_SIGNAL_DEVICE_REMOVED) ||
        (signal == USB_CAMERA_SIGNAL_SNAPSHOT_ABORT))
    {
        usb_camera_close_device();
        snapshot_capture_success = false;
        if (latest_frame_ready)
        {
            printf("[CAMERA] Preserving last successful snapshot for reuse after stream stop.\n");
        }
    }

    (void)cy_rtos_semaphore_set(&snapshot_ready_semaphore);
}

static bool usb_camera_select_stream(USBH_VIDEO_DEVICE_HANDLE h_device,
                                     uint32_t frame_interval,
                                     USBH_VIDEO_STREAM_CONFIG *stream_info,
                                     uint32_t *selected_interval)
{
    USBH_VIDEO_INPUT_HEADER_INFO input_header_info;
    USBH_VIDEO_FORMAT_INFO format_info;
    USBH_VIDEO_FRAME_INFO frame_info;
    USBH_STATUS status;
    unsigned format_index;
    unsigned frame_index;
    unsigned interval_index;
    unsigned frame_descriptor_count;
    bool fallback_found = false;
    unsigned fallback_format_index = 0U;
    unsigned fallback_frame_index = 0U;
    unsigned fallback_interval_index = 0U;
    uint32_t fallback_interval = 0U;
    uint8_t fallback_bits_per_pixel = 0U;
    uint8_t fallback_guid[USBH_VIDEO_GUID_LEN] = {0U};
    uint32_t fallback_min_bit_rate = 0U;
    uint32_t fallback_max_bit_rate = 0U;

    status = USBH_VIDEO_GetInputHeader(h_device, &input_header_info);
    if (status != USBH_STATUS_SUCCESS)
    {
        return false;
    }
    printf("[CAMERA] Input header: stillMethod=%u triggerSupport=%u triggerUsage=%u controlSize=%u\n",
           (unsigned)input_header_info.bStillCaptureMethod,
           (unsigned)input_header_info.bTriggerSupport,
           (unsigned)input_header_info.bTriggerUsage,
           (unsigned)input_header_info.bControlSize);

    for (format_index = 0U; format_index < input_header_info.bNumFormats; format_index++)
    {
        status = USBH_VIDEO_GetFormatInfo(h_device, format_index, &format_info);
        if (status != USBH_STATUS_SUCCESS)
        {
            continue;
        }

        if (format_info.FormatType != USB_CAMERA_FORMAT)
        {
            continue;
        }

        frame_descriptor_count = usb_camera_get_frame_descriptor_count(&format_info);
        for (frame_index = 0U; frame_index < frame_descriptor_count; frame_index++)
        {
            status = USBH_VIDEO_GetFrameInfo(h_device, format_index, frame_index, &frame_info);
            if (status != USBH_STATUS_SUCCESS)
            {
                continue;
            }

            if ((frame_info.wWidth != USB_CAMERA_FRAME_WIDTH) ||
                (frame_info.wHeight != USB_CAMERA_FRAME_HEIGHT))
            {
                continue;
            }

            for (interval_index = 0U; interval_index < frame_info.bFrameIntervalType; interval_index++)
            {
                if (frame_info.u.dwFrameInterval[interval_index] == frame_interval)
                {
                    memset(stream_info, 0, sizeof(*stream_info));
                    stream_info->Flags = 0U;
                    stream_info->FormatIdx = format_index;
                    stream_info->FrameIdx = frame_index;
                    stream_info->FrameIntervalIdx = interval_index + 1U;
                    stream_info->pfDataCallback = usb_camera_on_data_cb;
                    if (selected_interval != NULL)
                    {
                        *selected_interval = frame_info.u.dwFrameInterval[interval_index];
                    }
                    printf("[CAMERA] Selected UVC format: bitsPerPixel=%u frameCaps=0x%02X guid=%02X%02X%02X%02X-%02X%02X-%02X%02X-%02X%02X-%02X%02X%02X%02X%02X%02X minBitRate=%lu maxBitRate=%lu\n",
                           (unsigned)format_info.u.UncompressedFormat.bBitsPerPixel,
                           (unsigned)frame_info.bmCapabilities,
                           format_info.u.UncompressedFormat.guidFormat[0],
                           format_info.u.UncompressedFormat.guidFormat[1],
                           format_info.u.UncompressedFormat.guidFormat[2],
                           format_info.u.UncompressedFormat.guidFormat[3],
                           format_info.u.UncompressedFormat.guidFormat[4],
                           format_info.u.UncompressedFormat.guidFormat[5],
                           format_info.u.UncompressedFormat.guidFormat[6],
                           format_info.u.UncompressedFormat.guidFormat[7],
                           format_info.u.UncompressedFormat.guidFormat[8],
                           format_info.u.UncompressedFormat.guidFormat[9],
                           format_info.u.UncompressedFormat.guidFormat[10],
                           format_info.u.UncompressedFormat.guidFormat[11],
                           format_info.u.UncompressedFormat.guidFormat[12],
                           format_info.u.UncompressedFormat.guidFormat[13],
                           format_info.u.UncompressedFormat.guidFormat[14],
                           format_info.u.UncompressedFormat.guidFormat[15],
                           (unsigned long)frame_info.dwMinBitRate,
                           (unsigned long)frame_info.dwMaxBitRate);
                    return true;
                }

