dada561431/-/PSOC_Edge_Hachimitsu_Detector/proj_cm33_ns/usb_camera_host.c
                if ((!fallback_found) || (frame_info.u.dwFrameInterval[interval_index] > fallback_interval))
                {
                    fallback_found = true;
                    fallback_format_index = format_index;
                    fallback_frame_index = frame_index;
                    fallback_interval_index = interval_index + 1U;
                    fallback_interval = frame_info.u.dwFrameInterval[interval_index];
                    fallback_bits_per_pixel = format_info.u.UncompressedFormat.bBitsPerPixel;
                    memcpy(fallback_guid,
                           format_info.u.UncompressedFormat.guidFormat,
                           sizeof(fallback_guid));
                    fallback_min_bit_rate = frame_info.dwMinBitRate;
                    fallback_max_bit_rate = frame_info.dwMaxBitRate;
                }
            }
        }
    }

    if (!fallback_found)
    {
        return false;
    }

    memset(stream_info, 0, sizeof(*stream_info));
    stream_info->Flags = 0U;
    stream_info->FormatIdx = fallback_format_index;
    stream_info->FrameIdx = fallback_frame_index;
    stream_info->FrameIntervalIdx = fallback_interval_index;
    stream_info->pfDataCallback = usb_camera_on_data_cb;
    if (selected_interval != NULL)
    {
        *selected_interval = fallback_interval;
    }
    printf("[CAMERA] Selected fallback UVC format: bitsPerPixel=%u guid=%02X%02X%02X%02X-%02X%02X-%02X%02X-%02X%02X-%02X%02X%02X%02X%02X%02X minBitRate=%lu maxBitRate=%lu\n",
           (unsigned)fallback_bits_per_pixel,
           fallback_guid[0],
           fallback_guid[1],
           fallback_guid[2],
           fallback_guid[3],
           fallback_guid[4],
           fallback_guid[5],
           fallback_guid[6],
           fallback_guid[7],
           fallback_guid[8],
           fallback_guid[9],
           fallback_guid[10],
           fallback_guid[11],
           fallback_guid[12],
           fallback_guid[13],
           fallback_guid[14],
           fallback_guid[15],
           (unsigned long)fallback_min_bit_rate,
           (unsigned long)fallback_max_bit_rate);
    printf("[CAMERA] Preferred frame interval unavailable, falling back to slowest supported mode\n");
    return true;
}

static unsigned usb_camera_get_frame_descriptor_count(const USBH_VIDEO_FORMAT_INFO *format_info)
{
    if (format_info == NULL)
    {
        return 0U;
    }

    switch (format_info->FormatType)
    {
        case USBH_VIDEO_VS_FORMAT_UNCOMPRESSED:
            return format_info->u.UncompressedFormat.bNumFrameDescriptors;
        case USBH_VIDEO_VS_FORMAT_MJPEG:
            return format_info->u.MJPEG_Format.bNumFrameDescriptors;
        case USBH_VIDEO_VS_FORMAT_FRAME_BASED:
        case USBH_VIDEO_VS_FORMAT_H264:
            return format_info->u.H264_Format.bNumFrameDescriptors;
        default:
            return 0U;
    }
}

static uint32_t usb_camera_frame_interval_for_device(uint16_t vendor_id, uint16_t product_id)
{
    if ((vendor_id == USB_CAMERA_LOGITECH_VID) &&
        ((product_id == USB_CAMERA_LOGITECH_C920_PID) ||
         (product_id == USB_CAMERA_LOGITECH_C920E_PID)))
    {
        return USB_CAMERA_FRAME_INTERVAL_LOGI;
    }

    if ((vendor_id == USB_CAMERA_HBVCAM_0P3_VID) &&
        (product_id == USB_CAMERA_HBVCAM_0P3_PID))
    {
        return USB_CAMERA_FRAME_INTERVAL_0P3MP;
    }

    return 0U;
}

static bool usb_camera_publish_capture_frame(size_t frame_len)
{
    if (cy_rtos_mutex_get(&latest_frame_mutex, 0U) != CY_RSLT_SUCCESS)
    {
        return false;
    }

    frame_lengths[capture_frame_index] = frame_len;
    frame_source_strides[capture_frame_index] = (uint16_t)USB_CAMERA_ROW_BYTES;
    latest_frame_index = capture_frame_index;
    latest_frame_ready = true;
    capture_frame_index = (uint8_t)((capture_frame_index + 1U) % USB_CAMERA_NUM_FRAME_BUFFERS);
    cy_rtos_mutex_set(&latest_frame_mutex);
    return true;
}

static size_t usb_camera_get_expected_frame_bytes(void)
{
    return USB_CAMERA_FRAME_BYTES;
}

static void usb_camera_build_bmp_from_latest(uint8_t *out_bmp,
                                             size_t out_bmp_size,
                                             size_t *out_bmp_len,
                                             uint16_t *out_width,
                                             uint16_t *out_height)
{
    const uint8_t *frame;
    const uint32_t row_stride = ((USB_CAMERA_SNAPSHOT_WIDTH * 3U) + 3U) & ~3U;
    const uint32_t pixel_bytes = row_stride * USB_CAMERA_SNAPSHOT_HEIGHT;
    const uint32_t file_size = 54U + pixel_bytes;
    const uint32_t source_row_bytes = frame_source_strides[latest_frame_index] != 0U
                                        ? frame_source_strides[latest_frame_index]
                                        : USB_CAMERA_ROW_BYTES;
    uint32_t x;
    uint32_t y;

    if (out_bmp_size < file_size)
    {
        if (out_bmp_len != NULL)
        {
            *out_bmp_len = 0U;
        }
        return;
    }

    frame = frame_buffers[latest_frame_index];
    memset(out_bmp, 0, file_size);

    out_bmp[0] = 'B';
    out_bmp[1] = 'M';
    out_bmp[2] = (uint8_t)(file_size & 0xFFU);
    out_bmp[3] = (uint8_t)((file_size >> 8) & 0xFFU);
    out_bmp[4] = (uint8_t)((file_size >> 16) & 0xFFU);
    out_bmp[5] = (uint8_t)((file_size >> 24) & 0xFFU);
    out_bmp[10] = 54U;
    out_bmp[14] = 40U;
    out_bmp[18] = (uint8_t)(USB_CAMERA_SNAPSHOT_WIDTH & 0xFFU);
    out_bmp[19] = (uint8_t)((USB_CAMERA_SNAPSHOT_WIDTH >> 8) & 0xFFU);
    out_bmp[22] = (uint8_t)(USB_CAMERA_SNAPSHOT_HEIGHT & 0xFFU);
    out_bmp[23] = (uint8_t)((USB_CAMERA_SNAPSHOT_HEIGHT >> 8) & 0xFFU);
    out_bmp[26] = 1U;
    out_bmp[28] = 24U;
    out_bmp[34] = (uint8_t)(pixel_bytes & 0xFFU);
    out_bmp[35] = (uint8_t)((pixel_bytes >> 8) & 0xFFU);
    out_bmp[36] = (uint8_t)((pixel_bytes >> 16) & 0xFFU);
    out_bmp[37] = (uint8_t)((pixel_bytes >> 24) & 0xFFU);

    for (y = 0U; y < USB_CAMERA_SNAPSHOT_HEIGHT; y++)
    {
        uint8_t *row = &out_bmp[54U + ((USB_CAMERA_SNAPSHOT_HEIGHT - 1U - y) * row_stride)];
        for (x = 0U; x < USB_CAMERA_SNAPSHOT_WIDTH; x++)
        {
            const uint16_t src_x = (uint16_t)((x * USB_CAMERA_FRAME_WIDTH) / USB_CAMERA_SNAPSHOT_WIDTH);
            const uint16_t src_y = (uint16_t)((y * USB_CAMERA_FRAME_HEIGHT) / USB_CAMERA_SNAPSHOT_HEIGHT);
            uint8_t r;
            uint8_t g;
            uint8_t b;

            yuyv_to_rgb_pixel(frame, source_row_bytes, src_x, src_y, &r, &g, &b);
            row[(x * 3U) + 0U] = b;
            row[(x * 3U) + 1U] = g;
            row[(x * 3U) + 2U] = r;
        }
    }

    if (out_bmp_len != NULL)
    {
        *out_bmp_len = file_size;
    }
    if (out_width != NULL)
    {
        *out_width = USB_CAMERA_SNAPSHOT_WIDTH;
    }
    if (out_height != NULL)
    {
        *out_height = USB_CAMERA_SNAPSHOT_HEIGHT;
    }
}

static void yuyv_to_rgb_pixel(const uint8_t *frame,
                              uint32_t source_row_bytes,
                              uint16_t x,
                              uint16_t y,
                              uint8_t *r, uint8_t *g, uint8_t *b)
{
    const uint32_t pair_x = (uint32_t)(x & (uint16_t)~1U);
    const uint32_t idx = ((uint32_t)y * source_row_bytes) + (pair_x * 2U);
    const int32_t y0 = frame[idx + 0U];
    const int32_t u = frame[idx + 1U] - 128;
    const int32_t y1 = frame[idx + 2U];
    const int32_t v = frame[idx + 3U] - 128;
    const int32_t y_value = ((x & 1U) == 0U) ? y0 : y1;
    const int32_t c = y_value - 16;
    const int32_t d = u;
    const int32_t e = v;
    const int32_t r_tmp = (298 * c + 409 * e + 128) >> 8;
    const int32_t g_tmp = (298 * c - 100 * d - 208 * e + 128) >> 8;
    const int32_t b_tmp = (298 * c + 516 * d + 128) >> 8;

    *r = clamp_u8(r_tmp);
    *g = clamp_u8(g_tmp);
    *b = clamp_u8(b_tmp);
}

static uint8_t clamp_u8(int32_t value)
{
    if (value < 0)
    {
        return 0U;
    }
    if (value > 255)
    {
        return 255U;
    }
    return (uint8_t)value;
}
